[
  {
    "id": 1,
    "projectName": "Community Food Sharing Platform",
    "projectDetails": "A community-driven platform that connects people who have surplus food with those in need. The system allows donors to share food securely, track requests, and manage pickups. With Firebase authentication, real-time request handling, and a donation tracking dashboard, the platform promotes sustainability and reduces food waste.",
    "image": "/FoodShare.png",
    "clintlink": "https://github.com/atikurrahman33/Food-Sharing-Client",
    "serverlink": "https://github.com/atikurrahman33/Food-Sharing-server",
    "livelink": "https://foodsharing.netlify.app/",
    "features": [
      "User Authentication (Firebase): Secure and efficient login/registration system.",
      "Food Donation Management: Logged-in users can add, update, or delete food donations.",
      "Tracking & Requests: Users can manage donations in My Food and track requests in My Request.",
      "Food Pickup: Donated food can be collected at the location specified in the food card.",
      "Request Handling: Donors can view how many people requested their food and accept requests accordingly."
    ],
    "technologies": ["React", "Node.js", "Express", "MongoDB", "Tailwind CSS", "Firebase"],
    "tags": ["E-commerce", "Food Sharing", "Sustainability", "Donation"]
  },
  {
    "id": 2,
    "projectName": "Luxury & Classic Car Brand Shop",
    "projectDetails": "A marketplace-style web application for browsing, listing, and managing cars by brand. Users can register, log in, and add their own car listings, while visitors can explore vehicles without logging in. The platform includes role-based access for secure management and provides an easy way for buyers and sellers to connect.",
    "image": "/BrandShop.png",
    "clintlink": "https://github.com/atikurrahman33/Simple-Brand-Client",
    "serverlink": "https://github.com/atikurrahman33/Simple-Brand-Server",
    "livelink": "https://65380c5660e984007a96edf3--quiet-boba-078908.netlify.app/",
    "features": [
      "User Accounts: Sign up and log in using email-password or Google authentication.",
      "Car Management: Logged-in users can add cars under categories, and view, update, or delete only their own cars.",
      "Brand Section: All visitors can browse cars by brand, but detailed car information is restricted to logged-in users."
    ],
    "technologies": ["React", "Firebase", "Node.js", "Express", "MongoDB", "Tailwind CSS"],
    "tags": ["Marketplace", "Car", "Brand Shop", "Vehicles"]
  },
  {
    "id": 3,
    "projectName": "Student and Class Management",
    "projectDetails": "A role-based learning management system (LMS) that allows admins, teachers, and students to collaborate in one place. Admins manage users and approve teachers, teachers can create and publish courses, and students can enroll in classes with secure payment integration. The system also includes dashboards for each role, offering a seamless educational experience.",
    "image": "/studentManagement.png",
    "clintlink": "https://github.com/atikurrahman33/Student-and-Class-Management-client",
    "serverlink": "https://github.com/atikurrahman33/Student-and-Class-Management-server",
    "livelink": "https://edumentor12.netlify.app/",
    "features": [
      "User Authentication (Firebase): Secure registration and login for all users.",
      "Teacher Role (Admin Approval): Approved teachers can add, update, and delete courses, visible only after admin approval.",
      "Course Enrollment & Payment: Students can enroll in courses by paying the listed price.",
      "Role-Based Dashboards: Separate dashboards for Admin, Teacher, and Student with role-specific features."
    ],
    "technologies": ["React", "Node.js", "MongoDB", "Express", "Firebase", "Stripe"],
    "tags": ["Education", "Management", "LMS", "Students"]
  },
  {
    "id": 4,
    "projectName": "Gamer Zone",
    "projectDetails": "An interactive gaming portal designed for gamers to explore trending games, compete in leaderboards, and showcase achievements. The platform features a dynamic game library, user profiles, and community engagement options, making it a hub for gaming enthusiasts to connect and share their experiences.",
    "image": "/game.png",
    "clintlink": "https://github.com/atikurrahman33/KSA-2",
    
    "livelink": "https://ksa-2.vercel.app/",
    "features": [
      "Game library showcase with detailed game pages.",
      "Leaderboard system for player ranking and scores.",
      "User profiles with achievements and saved games."
    ],
    "technologies": ["Next.js", "Tailwind CSS", "Firebase"],
    "tags": ["Gaming", "Platform", "Entertainment", "Community"]
  },
  {
    "id": 5,
    "projectName": "IEEE Website",
    "projectDetails": "A dedicated platform for the IEEE Student Branch to showcase events, activities, and announcements. Built with Next.js and Tailwind CSS, it provides modern UI, event browsing, and context-based state management. The project is actively maintained and includes planned future upgrades like role-based dashboards for admins, moderators, and members.",
    "image": "/ieeegub.png",
    "clintlink": "https://github.com/atikurrahman33/IEEE-GUB-CLIENT",
    
    "livelink": "https://ieeegub.vercel.app/",
    "features": [
      "Modern UI: Built with Next.js and Tailwind CSS for a clean, responsive design.",
      "Event Management: Browse upcoming events with details such as date, time, and registration link.",
      "Dynamic Content: Event listings and details are managed via context-based state.",
      "Role-Based Sections (Future Scope): Planned dashboards for Admin, Moderator, and Members."
    ],
    "technologies": ["Next.js", "MongoDB", "Express", "Tailwind CSS"],
    "tags": ["Blog", "Education", "IEEE", "Events"]
  },
  {
    "id": 6,
    "projectName": "Flower Shop",
    "projectDetails": "An online flower shop where customers can browse a wide variety of flowers, view product details, and purchase through a secure checkout process. The platform includes order tracking, user-friendly UI, and an admin dashboard for product management, making it a complete e-commerce solution for florists.",
    "image": "/flower.png",
    "clintlink": "https://github.com/atikurrahman33/assignment01",
    
    "livelink": "https://assignment01-jade.vercel.app/",
    "features": [
      "Product catalog with categorized flowers.",
      "Cart & checkout with payment integration.",
      "Order tracking and customer management."
    ],
    "technologies": ["React", "Node.js", "Express", "MongoDB", "Stripe", "Tailwind CSS"],
    "tags": ["E-commerce", "Flower Shop", "Online Store", "Retail"]
  }
]
